In [75]:
# Import necessary libraries
import numpy as np
import pandas as pd

In [76]:
# Load data and check its first few rows
df = pd.read_csv("FoodBalanceSheets_E_Africa_NOFLAG.csv", encoding="latin-1")
df.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [77]:
# Check its last rows
df.tail()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
60938,181,Zimbabwe,2899,Miscellaneous,5142,Food,1000 tonnes,42.00,46.00,33.00,19.00,16.00
60939,181,Zimbabwe,2899,Miscellaneous,645,Food supply quantity (kg/capita/yr),kg,3.06,3.33,2.35,1.33,1.08
60940,181,Zimbabwe,2899,Miscellaneous,664,Food supply (kcal/capita/day),kcal/capita/day,3.00,4.00,3.00,1.00,1.00
60941,181,Zimbabwe,2899,Miscellaneous,674,Protein supply quantity (g/capita/day),g/capita/day,0.10,0.11,0.08,0.04,0.04
60942,181,Zimbabwe,2899,Miscellaneous,684,Fat supply quantity (g/capita/day),g/capita/day,0.04,0.05,0.03,0.02,0.01

In [78]:
# View row and column info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60943 entries, 0 to 60942
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Area Code     60943 non-null  int64
 1   Area          60943 non-null  object
 2   Item Code     60943 non-null  int64
 3   Item          60943 non-null  object
 4   Element Code  60943 non-null  int64
 5   Element       60943 non-null  object
 6   Unit          60943 non-null  object
 7   Y2014         59354 non-null  float64
 8   Y2015         59395 non-null  float64
 9   Y2016         59408 non-null  float64
 10  Y2017         59437 non-null  float64
 11  Y2018         59507 non-null  float64
dtypes: float64(5), int64(3), object(4)
memory usage: 5.6+ MB

In [79]:
# Describe numerical columns
df.describe()

,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
count,60943.000000,60943.000000,60943.000000,59354.000000,59395.000000,59408.000000,59437.000000,59507.000000
mean,134.265576,2687.176706,3814.856456,134.196282,135.235966,136.555222,140.917765,143.758381
std,72.605709,146.055739,2212.007033,1567.663696,1603.403984,1640.007194,1671.862359,1710.782658
min,4.000000,2501.000000,511.000000,-1796.000000,-3161.000000,-3225.000000,-1582.000000,-3396.000000
25%,74.000000,2562.000000,684.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,136.000000,2630.000000,5142.000000,0.090000,0.080000,0.080000,0.100000,0.070000
75%,195.000000,2775.000000,5511.000000,8.340000,8.460000,8.430000,9.000000,9.000000
max,276.000000,2961.000000,5911.000000,176405.000000,181137.000000,185960.000000,190873.000000,195875.000000

In [80]:
# Which Area had the highest sum in 2017?
df[['Y2017', 'Area']].groupby('Area').sum().sort_values('Y2017', ascending=False).head()

                   Y2017
Area
Nigeria       1483268.23
Egypt          866379.92
South Africa   517590.54
Ethiopia       448683.76
Morocco        388495.36

In [81]:
# Which Area had the 7th lowest sum in 2017?
df[['Y2017', 'Area']].groupby('Area').sum().sort_values('Y2017').head(7)

                          Y2017
Area
Sudan (former)             0.00
Ethiopia PDR               0.00
Comoros                   59.84
Seychelles               442.34
Sao Tome and Principe  12662.63
Cabo Verde             14650.74
Guinea-Bissau          19102.77

In [82]:
# What year has the highest sum of Stock Variation?
year_cols = df.columns[df.columns.str.startswith('Y2')]
df.groupby('Element')[year_cols].sum().loc['Stock Variation'].sort_values(ascending=False)

Y2014    58749.83
Y2017    54316.91
Y2015    34910.99
Y2016    33140.12
Y2018    20577.91
Name: Stock Variation, dtype: float64

In [83]:
# What is the total number and percentage of missing data in 2014 to 3 decimal places?
miss_2014 = df.isna().sum()['Y2014']
percent_2014 = np.round(miss_2014 / df.shape[0] * 100, 3)
print("total number of missing data in 2014:", miss_2014)
print("total percentage of missing data in 2014:", percent_2014)

total number of missing data in 2014: 1589
total percentage of missing data in 2014: 2.607

In [84]:
# What is the total number of the sum of Processing in 2017?
df.groupby('Element')[year_cols].sum().loc['Processing', 'Y2017']

292836.0

In [85]:
# What is the total number of unique countries in the dataset?
df.Area.nunique()

49

In [86]:
# What is the total Protein supply quantity in Madagascar in 2015?
df[df.Area == 'Madagascar'].groupby('Element')['Y2015'].sum()['Protein supply quantity (g/capita/day)']

173.05

In [87]:
# What is the total sum of Wine produced in 2015 and 2018 respectively?
df.groupby('Item')[year_cols].sum().loc['Wine', ['Y2015', 'Y2018']]

Y2015    4251.81
Y2018    4039.32
Name: Wine, dtype: float64

In [88]:
# Which year had the least correlation with ‘Element Code’?
df.corr(numeric_only=True).iloc[3:, 2].idxmin()

'Y2016'